/*Задача 43: Напишите программу, которая найдёт точку пересечения двух прямых, 
заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; значения b1, k1, b2 и k2 задаются пользователем.
b1 = 2, k1 = 5, b2 = 4, k2 = 9 -> (-0,5; -0,5)*/

Console.Write("Введите k1  и b1 для y = k1 * x + b1:");
int k1 = int.Parse(ReadLine()!);
Console.Write("\n");
int b1 = int.Parse(ReadLine()!);

Console.Write("Введите k2 и b2 для y = k2 * x + b2:");
int k2 = int.Parse(ReadLine()!);
Console.Write("\n");
int b2 = int.Parse(ReadLine()!);



